-- MySQL dump 10.13  Distrib 5.7.27, for Linux (x86_64)
--
-- Host: 127.0.0.1    Database: kinotop
-- ------------------------------------------------------
-- Server version	5.7.27

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `movie`
--

DROP TABLE IF EXISTS `movie`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `movie` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `in_top_date` datetime(6) NOT NULL,
  `original_name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `position` int(11) NOT NULL,
  `rating` float NOT NULL,
  `russian_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `voters_count` int(11) NOT NULL,
  `year` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=61 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `movie`
--

LOCK TABLES `movie` WRITE;
/*!40000 ALTER TABLE `movie` DISABLE KEYS */;
INSERT INTO `movie` VALUES (1,'2019-09-25 00:00:00.000000','The Shawshank Redemption',1,9.19,'Побег из Шоушенка',509759,1994),(2,'2019-09-25 00:00:00.000000','The Green Mile',2,9.134,'Зеленая миля',476445,1999),(3,'2019-09-25 00:00:00.000000','Forrest Gump',3,9.012,'Форрест Гамп',464009,1994),(4,'2019-09-25 00:00:00.000000','Schindler\'s List',4,8.886,'Список Шиндлера',257606,1993),(5,'2019-09-25 00:00:00.000000','Intouchables',5,8.831,'1+1',499247,2011),(6,'2019-09-25 00:00:00.000000','Léon',6,8.774,'Леон',390826,1994),(7,'2019-09-25 00:00:00.000000','Inception',7,8.773,'Начало',530635,2010),(8,'2019-09-25 00:00:00.000000','The Lion King',8,8.757,'Король Лев',333037,1994),(9,'2019-09-25 00:00:00.000000','Fight Club',9,8.712,'Бойцовский клуб',455763,1999),(10,'2019-09-25 00:00:00.000000',NULL,10,8.708,'Иван Васильевич меняет профессию',349690,1973),(11,'2019-09-26 00:00:00.000000','The Shawshank Redemption',1,9.19,'Побег из Шоушенка',509870,1994),(12,'2019-09-26 00:00:00.000000','The Green Mile',2,9.134,'Зеленая миля',476548,1999),(13,'2019-09-26 00:00:00.000000','Forrest Gump',3,9.012,'Форрест Гамп',464102,1994),(14,'2019-09-26 00:00:00.000000','Schindler\'s List',4,8.886,'Список Шиндлера',257656,1993),(15,'2019-09-26 00:00:00.000000','Intouchables',5,8.831,'1+1',499361,2011),(16,'2019-09-26 00:00:00.000000','Léon',6,8.774,'Леон',390912,1994),(17,'2019-09-26 00:00:00.000000','Inception',7,8.773,'Начало',530730,2010),(18,'2019-09-26 00:00:00.000000','The Lion King',8,8.757,'Король Лев',333111,1994),(19,'2019-09-26 00:00:00.000000','Fight Club',9,8.712,'Бойцовский клуб',455858,1999),(20,'2019-09-26 00:00:00.000000',NULL,10,8.708,'Иван Васильевич меняет профессию',349769,1973),(21,'2019-09-27 00:00:00.000000','The Shawshank Redemption',1,9.19,'Побег из Шоушенка',509930,1994),(22,'2019-09-27 00:00:00.000000','The Green Mile',2,9.134,'Зеленая миля',476617,1999),(23,'2019-09-27 00:00:00.000000','Forrest Gump',3,9.012,'Форрест Гамп',464153,1994),(24,'2019-09-27 00:00:00.000000','Schindler\'s List',4,8.886,'Список Шиндлера',257694,1993),(25,'2019-09-27 00:00:00.000000','Intouchables',5,8.831,'1+1',499426,2011),(26,'2019-09-27 00:00:00.000000','Léon',6,8.774,'Леон',390959,1994),(27,'2019-09-27 00:00:00.000000','Inception',7,8.773,'Начало',530790,2010),(28,'2019-09-27 00:00:00.000000','The Lion King',8,8.757,'Король Лев',333147,1994),(29,'2019-09-27 00:00:00.000000','Fight Club',9,8.712,'Бойцовский клуб',455913,1999),(30,'2019-09-27 00:00:00.000000',NULL,10,8.708,'Иван Васильевич меняет профессию',349806,1973),(31,'2019-09-28 00:00:00.000000','The Shawshank Redemption',1,9.19,'Побег из Шоушенка',510018,1994),(32,'2019-09-28 00:00:00.000000','The Green Mile',2,9.134,'Зеленая миля',476690,1999),(33,'2019-09-28 00:00:00.000000','Forrest Gump',3,9.012,'Форрест Гамп',464221,1994),(34,'2019-09-28 00:00:00.000000','Schindler\'s List',4,8.886,'Список Шиндлера',257720,1993),(35,'2019-09-28 00:00:00.000000','Intouchables',5,8.831,'1+1',499509,2011),(36,'2019-09-28 00:00:00.000000','Léon',6,8.774,'Леон',391043,1994),(37,'2019-09-28 00:00:00.000000','Inception',7,8.773,'Начало',530872,2010),(38,'2019-09-28 00:00:00.000000','The Lion King',8,8.757,'Король Лев',333201,1994),(39,'2019-09-28 00:00:00.000000','Fight Club',9,8.712,'Бойцовский клуб',455986,1999),(40,'2019-09-28 00:00:00.000000',NULL,10,8.708,'Иван Васильевич меняет профессию',349851,1973),(41,'2019-09-29 00:00:00.000000','The Shawshank Redemption',1,9.19,'Побег из Шоушенка',510147,1994),(42,'2019-09-29 00:00:00.000000','The Green Mile',2,9.134,'Зеленая миля',476797,1999),(43,'2019-09-29 00:00:00.000000','Forrest Gump',3,9.012,'Форрест Гамп',464334,1994),(44,'2019-09-29 00:00:00.000000','Schindler\'s List',4,8.886,'Список Шиндлера',257787,1993),(45,'2019-09-29 00:00:00.000000','Intouchables',5,8.831,'1+1',499632,2011),(46,'2019-09-29 00:00:00.000000','Léon',6,8.774,'Леон',391114,1994),(47,'2019-09-29 00:00:00.000000','Inception',7,8.773,'Начало',530981,2010),(48,'2019-09-29 00:00:00.000000','The Lion King',8,8.757,'Король Лев',333264,1994),(49,'2019-09-29 00:00:00.000000','Fight Club',9,8.712,'Бойцовский клуб',456096,1999),(50,'2019-09-29 00:00:00.000000',NULL,10,8.708,'Иван Васильевич меняет профессию',349910,1973),(51,'2019-09-30 00:00:00.000000','The Shawshank Redemption',1,9.19,'Побег из Шоушенка',517500,1994),(52,'2019-09-30 00:00:00.000000','The Green Mile',2,9.134,'Зеленая миля',483465,1999),(53,'2019-09-30 00:00:00.000000','Forrest Gump',3,9.012,'Форрест Гамп',471594,1994),(54,'2019-09-30 00:00:00.000000','Schindler\'s List',4,8.886,'Список Шиндлера',261911,1993),(55,'2019-09-30 00:00:00.000000','Intouchables',5,8.831,'1+1',507704,2011),(56,'2019-09-30 00:00:00.000000','Léon',6,8.774,'Леон',397027,1994),(57,'2019-09-30 00:00:00.000000','Inception',7,8.773,'Начало',538677,2010),(58,'2019-09-30 00:00:00.000000','The Lion King',8,8.757,'Король Лев',338291,1994),(59,'2019-09-30 00:00:00.000000','Fight Club',9,8.712,'Бойцовский клуб',463333,1999),(60,'2019-09-30 00:00:00.000000',NULL,10,8.708,'Иван Васильевич меняет профессию',355354,1973);
/*!40000 ALTER TABLE `movie` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2019-09-30 20:58:30
